&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // Получаем переданного сотрудника
    СсылкаНаСотрудника = Параметры.ТекущийСотрудник;
    
    Если СсылкаНаСотрудника <> Неопределено Тогда
        
        // Получаем объект сотрудника
        СотрудникОбъект = СсылкаНаСотрудника.ПолучитьОбъект();
        
        // Заполняем Наименование (обязательное поле)
        Если НЕ ЗначениеЗаполнено(Объект.Наименование) И ЗначениеЗаполнено(СотрудникОбъект.Наименование) Тогда
            Объект.Наименование = СотрудникОбъект.Наименование;
        КонецЕсли;
        
        // 1. Дата рождения
        Если НЕ ЗначениеЗаполнено(Объект.ДатаРождения) И ЗначениеЗаполнено(СотрудникОбъект.ДатаРождения) Тогда
            Объект.ДатаРождения = СотрудникОбъект.ДатаРождения;
        КонецЕсли;
        
        // 2. Должность
        Если НЕ ЗначениеЗаполнено(Объект.Должность) И ЗначениеЗаполнено(СотрудникОбъект.Должность) Тогда
            Объект.Должность = СотрудникОбъект.Должность;
        КонецЕсли;
        
        // 3. Дата приема
        Если НЕ ЗначениеЗаполнено(Объект.ДатаПриема) И ЗначениеЗаполнено(СотрудникОбъект.ДатаПриемаНаРаботу) Тогда
            Объект.ДатаПриема = СотрудникОбъект.ДатаПриемаНаРаботу;
        КонецЕсли;
        
        // 4. Дата увольнения
        Если НЕ ЗначениеЗаполнено(Объект.ДатаУвольнения) И ЗначениеЗаполнено(СотрудникОбъект.ДатаУвольнения) Тогда
            Объект.ДатаУвольнения = СотрудникОбъект.ДатаУвольнения;
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

    
&НаКлиенте
Процедура СоставСемьи(Команда)
    Отбор = Новый Структура("Наименование", Объект.Ссылка);
    
    // Передаём отбор в параметры формы списка
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
    
    // Открываем форму списка
    ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСпискаСоставСемьи", ПараметрыФормы);
       
КонецПроцедуры    

&НаКлиенте
Процедура ВоинскийУчет(Команда)
	 ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
    ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВоинскийУчет", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТрудоваяДеятельность(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
