
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник,
		|	ЗаработнаяПлатаФактическийПериодДействия.ВидРасчета,
		|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияНачало,
		|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияКонец
		|ИЗ
		|	РегистрРасчета.ЗаработнаяПлата.ФактическийПериодДействия КАК ЗаработнаяПлатаФактическийПериодДействия";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГантаРасчет.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серия = ДиаграммаГантаРасчет.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграммаГантаРасчет.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
		
	КонецЦикла;

	
КонецПроцедуры
